# Задание 10
str10 = input('Введите строку: ')
for i in range(len(str10)-1, -1, -1):
    print(str10[i])
