# Задание 1
n = input('Введите количество чисел для расчета суммы четных: ')
sum1 = 0
for x in range(2, int(n), 2):
    sum1 += x
print(sum1)


# Задание 2